Engimusing/engimusing-firmware/cortex-m0plus/1.0.1/bootloaders/EFM32ZGUSB/serial.c
/**************************************************************************
 * @file serial.c
 * @brief Serial code for the EFM32 bootloader
 * @author Silicon Labs
 * @version 1.68
 ***************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 ***************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ***************************************************************************/

#include "em_emu.h"
#include <stdbool.h>
#include <stdint.h>
#include "config.h"
#include "serial.h"

volatile struct circularBuffer
{
  uint8_t  data[BUFFERSIZE];  /* data buffer */
  uint32_t rdI;               /* read index */
  uint32_t wrI;               /* write index */
  uint32_t pendingBytes;      /* count of how many bytes are not yet handled */
  bool     overflow;          /* buffer overflow indicator */
} rxBuf0, txBuf0, rxBuf1, txBuf1 = { {0}, 0, 0, 0, false };


void tty0_rx_data(uint8_t rxData)
{
  rxBuf0.data[rxBuf0.wrI] = rxData;
  rxBuf0.wrI = (rxBuf0.wrI + 1) % BUFFERSIZE;
  rxBuf0.pendingBytes++;
  if (rxBuf0.pendingBytes > BUFFERSIZE)    // Flag Rx overflow
    {
      rxBuf0.overflow = true;
    }
}

void tty1_rx_data(uint8_t rxData)
{
  rxBuf1.data[rxBuf1.wrI] = rxData;
  rxBuf1.wrI = (rxBuf1.wrI + 1) % BUFFERSIZE;
  rxBuf1.pendingBytes++;
  if (rxBuf1.pendingBytes > BUFFERSIZE)    // Flag Rx overflow
    {
      rxBuf1.overflow = true;
    }
}

uint8_t tty0_get_pending_byte(void)
{
  uint8_t data = txBuf0.data[txBuf0.rdI];      // Transmit pending character
  txBuf0.rdI = (txBuf0.rdI + 1) % BUFFERSIZE;
  txBuf0.pendingBytes--;
  return data;
}

uint8_t tty1_get_pending_byte(void)
{
  uint8_t data = txBuf1.data[txBuf1.rdI];      // Transmit pending character
  txBuf1.rdI = (txBuf1.rdI + 1) % BUFFERSIZE;
  txBuf1.pendingBytes--;
  return data;
}

uint32_t tty0_get_number_pendingBytes(void)
{
  return txBuf0.pendingBytes;
}

uint32_t tty1_get_number_pendingBytes(void)
{
  return txBuf1.pendingBytes;
}


// Transmit single byte
void SERIAL_txByte(uint8_t uartID, uint8_t data)
{
  if(uartID == 0) {
    if ((txBuf0.pendingBytes + 1) > BUFFERSIZE)  // Check if Tx queue has room for new data
      {
	while ((txBuf0.pendingBytes + 1) > BUFFERSIZE) ;    // Wait until there is room in queue
      }
    txBuf0.data[txBuf0.wrI] = data;  // Copy ch into txBuffer
    txBuf0.wrI             = (txBuf0.wrI + 1) % BUFFERSIZE;
    tty0_disable_tx_ints();
    txBuf0.pendingBytes++;  // Increment pending byte counter
    tty0_enable_tx_ints();
    tty0_enable_tx_int();
  } else {
    if ((txBuf1.pendingBytes + 1) > BUFFERSIZE)  // Check if Tx queue has room for new data
      {
	while ((txBuf1.pendingBytes + 1) > BUFFERSIZE) ;    // Wait until there is room in queue
      }
    txBuf1.data[txBuf1.wrI] = data;  // Copy ch into txBuffer
    txBuf1.wrI             = (txBuf1.wrI + 1) % BUFFERSIZE;
    tty1_disable_tx_ints();
    txBuf1.pendingBytes++;  // Increment pending byte counter
    tty1_enable_tx_ints();
    tty1_enable_tx_int();
  }
}

uint8_t SERIAL_rxByte(uint8_t uartID)
{
  uint8_t ch;
  // Check if there is a byte that is ready to be fetched. If no byte is ready, wait for incoming data
  if(uartID == 0) {
    if (rxBuf0.pendingBytes < 1) {
	while (rxBuf0.pendingBytes < 1) ;
	EMU_EnterEM1();
    }
    ch = rxBuf0.data[rxBuf0.rdI];    // Copy data from buffer
    rxBuf0.rdI = (rxBuf0.rdI + 1) % BUFFERSIZE;
    tty0_disable_rx_ints();
    rxBuf0.pendingBytes--;    // Decrement pending byte counter
    tty0_enable_rx_ints();
    return ch;
 } else {
    if (rxBuf1.pendingBytes < 1) {
	while (rxBuf1.pendingBytes < 1) ;
	EMU_EnterEM1();
    }
    ch = rxBuf1.data[rxBuf1.rdI];    // Copy data from buffer
    rxBuf1.rdI = (rxBuf1.rdI + 1) % BUFFERSIZE;
    tty1_disable_rx_ints();
    rxBuf1.pendingBytes--;    // Decrement pending byte counter
    tty1_enable_rx_ints();
    return ch;
   }
  return 0;  
}

uint8_t SERIAL_check_rxByte(uint8_t uartID)
{
  uint8_t ch;
  if(uartID == 0)  {
    if (rxBuf0.pendingBytes > 0) {
      ch = rxBuf0.data[rxBuf0.rdI];    // Copy data from buffer
      rxBuf0.rdI = (rxBuf0.rdI + 1) % BUFFERSIZE;
      tty0_disable_rx_ints();
      rxBuf0.pendingBytes--;    // Decrement pending byte counter
      tty0_enable_rx_ints();
      return ch;
    }
  } else {
    if (rxBuf1.pendingBytes > 0) {
      ch = rxBuf1.data[rxBuf1.rdI];    // Copy data from buffer
      rxBuf1.rdI = (rxBuf1.rdI + 1) % BUFFERSIZE;
      tty1_disable_rx_ints();
      rxBuf1.pendingBytes--;    // Decrement pending byte counter
      tty1_enable_rx_ints();
      return ch;
    }
  }
  return 0;
}

uint8_t SERIAL_rx_ready(uint8_t uartID)
{
  if(uartID == 0)
    return (rxBuf0.pendingBytes);
  else
    return (rxBuf1.pendingBytes);
  return 0;  
}


void putc0(void* p, char ch)
{
  (void) p;

  while ((txBuf0.pendingBytes + 1) > BUFFERSIZE) ;    // Wait until there is room in queue
  txBuf0.data[txBuf0.wrI] = ch;  // Copy ch into txBuffer
  txBuf0.wrI = (txBuf0.wrI + 1) % BUFFERSIZE;
  tty0_disable_tx_ints();
  txBuf0.pendingBytes++;  // Increment pending byte counter
  tty0_enable_tx_ints();
  tty0_enable_tx_int();
}

void putc1(void* p, char ch)
{
  (void) p;

  while ((txBuf1.pendingBytes + 1) > BUFFERSIZE) ;    // Wait until there is room in queue
  txBuf1.data[txBuf1.wrI] = ch;  // Copy ch into txBuffer
  txBuf1.wrI = (txBuf1.wrI + 1) % BUFFERSIZE;
  tty1_disable_tx_ints();
  txBuf1.pendingBytes++;  // Increment pending byte counter
  tty1_enable_tx_ints();
  tty1_enable_tx_int();
}

